BusinessProcesses/СогласованиеОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<BusinessProcess>
		<Properties>
			<Name>СогласованиеОтпуска</Name>
			<Task>Task.СогласованиеОтпуска</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаОтпуск</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

InformationRegisters/ГрафикОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ГрафикОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВОтпускеС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВОтпускеПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияСогласованийОтпусков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСогласованийОтпусков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеНаОтпуск</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗаявлениеНаОтпуск.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявлениеНаОтпуск</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияОтпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Согласованно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

BusinessProcesses/СогласованиеОтпуска/Ext/ObjectModule.bsl
Процедура ЗавершениеССогласованиемПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	ЗаявлениеНаОтпуск = ДокументОснование.ПолучитьОбъект();
	
	ЗаявлениеНаОтпуск.Согласованно = Истина; 
	
	Движение = РегистрыСведений.ГрафикОтпусков.СоздатьМенеджерЗаписи();
	
	Движение.Сотрудник 		= ЗаявлениеНаОтпуск.Сотрудник;
	Движение.ВОтпускеС 		= ЗаявлениеНаОтпуск.ДатаНачалаОтпуска;
	Движение.ВОтпускеПо 	= ЗаявлениеНаОтпуск.ДатаОкончанияОтпуска;
	
	Движение.Записать();
	
	УведомлениеДляПользователя(ЗаявлениеНаОтпуск.Сотрудник, ДокументОснование, "Согласованно ");
	
	ЗаявлениеНаОтпуск.Записать();
	
	СделатьЗаписьВИсториюСогласований(ДокументОснование,
										Справочники.Сотрудники.ПустаяСсылка(),
											"Согласованно",
												ТекущаяДатаСеанса());
			
КонецПроцедуры

Процедура СогласованноСРуководителемПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат) 
	
	Результат = СогласованноРуководителем;
	
КонецПроцедуры

Процедура СогласованноСHRПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
		
	Результат = СогласованноHR;
	
КонецПроцедуры

Процедура СогласованиеСРуководителемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	ФормируемыеЗадачи[0].Исполнитель = ФормируемыеЗадачи[0].БизнесПроцесс.Сотрудник.Руководитель;
	ФормируемыеЗадачи[0].СрокВыполнения = КонецДня((ТекущаяДатаСеанса() + 86400));
	
	СделатьЗаписьВИсториюСогласований(ДокументОснование,
										ФормируемыеЗадачи[0].Исполнитель,
											"На согласовании у руководителя",
												ТекущаяДатаСеанса());
	 
КонецПроцедуры

Процедура УведомлениеДляПользователя(Сотрудник, Документ, Результат)

	ЗадачаУведомление = Задачи.ЗадачаСотрудника.СоздатьЗадачу();
	
    ЗадачаУведомление.Наименование		= "Ознакомиться с результатом: " + Результат + Документ;
	ЗадачаУведомление.Исполнитель 		= Сотрудник;
	ЗадачаУведомление.Дата 				= ТекущаяДатаСеанса();
	ЗадачаУведомление.СрокВыполнения 	= ТекущаяДатаСеанса() + 86400;  
	
	ЗадачаУведомление.Записать();

КонецПроцедуры


Процедура ЗавершениеНеСогласованноПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявлениеНаОтпуск.Сотрудник КАК Сотрудник,
		|	ЗаявлениеНаОтпуск.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявлениеНаОтпуск КАК ЗаявлениеНаОтпуск
		|ГДЕ
		|	ЗаявлениеНаОтпуск.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		УведомлениеДляПользователя(Выборка.Сотрудник, Выборка.Ссылка, "Не Согласованно ");	
	КонецЕсли;
	
	СделатьЗаписьВИсториюСогласований(ДокументОснование,
										Справочники.Сотрудники.ПустаяСсылка(),
											"Не согласованно",
												ТекущаяДатаСеанса());

	
КонецПроцедуры


Процедура ПодтверждениеHRПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].СрокВыполнения = КонецДня((ТекущаяДатаСеанса() + 86400));
	
	СделатьЗаписьВИсториюСогласований(ДокументОснование,
										ФормируемыеЗадачи[0].Исполнитель,
											"На согласовании у HR",
												ТекущаяДатаСеанса());

КонецПроцедуры

Процедура ПодтверждениеHRПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Если НЕ ЗначениеЗаполнено(Задача.Исполнитель) Тогда
		ОбъектЗадача = Задача.ПолучитьОбъект();
		ОбъектЗадача.Исполнитель = ПараметрыСеанса.ТекущийПользователь;
		ОбъектЗадача.Записать();
	КонецЕсли;
КонецПроцедуры 

Процедура СделатьЗаписьВИсториюСогласований(Документ, Исполнитель, Этап, Дата)

	Движение = РегистрыСведений.ИсторияСогласованийОтпусков.СоздатьМенеджерЗаписи();
	
	Движение.Документ 		= Документ;
	Движение.Исполнитель 	= Исполнитель;
	Движение.Этап	     	= Этап;
	Движение.Дата			= Дата;    
	
	Движение.Записать();

КонецПроцедуры // ()
